# KeepRotatedTextReadable Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNoteOptions..::..KeepRotatedTextReadable Property
TextNoteOptions Class See Also
---
Flag controling whether a rotate text is to stay oriented to be always readable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool KeepRotatedTextReadable { get; set; }
```

Visual Basic
---
```text
Public Property KeepRotatedTextReadable As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool KeepRotatedTextReadable {
	bool get ();
	void set (bool value);
}
```

# Remarks
Default value is True.
# See Also
TextNoteOptions Class
Autodesk.Revit.DB Namespace